W4D1/library/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    # your code here
		@books = Book.all

DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
		Book.find(params[:id]).destroy